{
	"name": "Andy Bond",
	"pronouns": "he/him",
	"occupation": "Software Engineer",
	"location": "Orlando, FL",
	"summary": "Experienced Software Engineer with a demonstrated history of working in a non-partisan government role. Skilled in Angular, JavaScript, HTML5, CSS3, .NET Core, ASP.NET MVC, C#, WPF, Windows Forms, and always ready to learn more. Strong engineering professional with a Bachelor of Science (B.S.) focused in Computer Science from the University of Kentucky.",
	"education": [
		{
			"start": "2012-08-01 EST",
			"end": "2015-12-15",
			"degree": "Bachelor of Science (B.S.), Computer Science",
			"organization": "University of Kentucky",
			"location": "Lexington, KY",
			"display": true
		},
		{
			"start": "2008-08-01 EST",
			"end": "2012-05-15",
			"degree": "High School Diploma",
			"organization": "Starkville High School",
			"location": "Starkville, MS",
			"display": false
		}
	],
	"experience": [
		{
			"start": "2021-12-07 EST",
			"end": "",
			"position": "Software Engineering Technical Leader",
			"organization": "Cisco",
			"location": "Remote",
			"summary": [
				"As Technical Leader, drove the successful planning, execution, and delivery of critical, large-scale features, resulting in measurable improvements to customer experience.",
				"Led the complete frontend development for multiple AI Assistants, and architected reusable, flexible AI Assistant components for seamless integration and adoption by external teams.",
				"Played a key role in frontend architecture review and leadership meetings, consistently providing valuable feedback and strategic guidance on high-level initiatives.",
				"Mentored and guided team members through dedicated office hours and ad-hoc support, fostering a culture of knowledge sharing and technical growth across multiple teams.",
				"Contributed significantly to project planning and workflow optimization, leading efforts in work estimation, requirement refinement, and task organization to enhance team efficiency and project delivery.",
				"Developed and optimized highly scalable and maintainable components and services using Angular and NgRx, within a robust Nx Monorepo environment.",
				"Authored and maintained critical organizational documentation, including new developer onboarding guides, project setup instructions, and the implementation of Architecture Decision Records (ADRs) to standardize processes.",
				"Played a key role in building and expanding internal design system component libraries, contributing with Angular, React, and Storybook.",
				"Implemented and enforced rigorous testing practices, including Jest unit tests and Playwright/Cypress E2E tests, to maintain superior code quality and reliability."
			],
			"display": true
		},
		{
			"start": "2016-02-01 EST",
			"end": "2021-12-03 EST",
			"position": "Software Engineer",
			"organization": "Legislative Research Commission",
			"location": "Frankfort, KY",
			"summary": [
				"Created responsive web based applications with a strong focus on user experience using Angular to be used by LRC staff, legislators, and the general public.",
				"Worked directly with clients to develop new project features and migrate out-of-date applications to modern standards.",
				"Developed templates and libraries used in nearly every Angular application in the agency.",
				"Developed APIs using ASP.NET Core MVC to provide data to various applications and other APIs/microservices.",
				"Developed multiple Windows desktop applications to assist members of LRC staff in their various duties using both Windows Forms and WPF.",
				"Managed SQL tables, stored procedures, functions, users, and roles for use in the applications that were developed."
			],
			"display": true
		},
		{
			"start": "2012-09-01 EST",
			"end": "2016-01-01 EST",
			"position": "Photographer",
			"organization": "University of Kentucky",
			"location": "Lexington, KY",
			"summary": [
				"Photographed banquets, concerts, student and faculty activities, sporting events, speeches, and many other functions.",
				"Organized group shots of 50+ people."
			],
			"display": true
		},
		{
			"start": "2015-06-01 PDT",
			"end": "2015-08-01 PDT",
			"position": "Software Developer (Intern)",
			"organization": "California Resources Corporation",
			"location": "Bakersfield, CA",
			"summary": [
				"Developed a server application using C# that fetched and cached live images from IP based security cameras.",
				"Created client webpage application to facilitate selecting cameras for a lived feed of any camera in the field using HTML, CSS, JavaScript, and ASP.NET."
			],
			"display": false
		},
		{
			"start": "2014-05-01 PDT",
			"end": "2014-09-01 PDT",
			"summary": [
				"Created and edited over 200 human-machine interface pages for online viewing.",
				"Created a program to improve speed on human-machine interface development process using Visual Basic 6.0."
			],
			"position": "Software Developer (Intern)",
			"organization": "Occidental Petroleum Corporation",
			"location": "Bakersfield, CA",
			"display": false
		},
		{
			"start": "2012-05-01 EST",
			"end": "2013-09-01 EST",
			"position": "Lifeguard",
			"organization": "Starkville Country Club",
			"location": "Starkville, MS",
			"summary": [
				"Observed the pool and surrounding area to ensure the safety of all swimmers and guests.",
				"Performed First Aid when necessary.",
				"Cleaned and maintained the pool and pool deck.",
				"Occasionally filled in for the Head Lifeguard when out of town by helping new lifeguards determine the right course of action for different situations."
			],
			"display": false
		}
	],
	"skills": [
		{
			"name": "Angular",
			"icon": "simple-icons:angular"
		},
		{
			"name": "NgRx",
			"icon": "simple-icons:ngrx"
		},
		{
			"name": "RxJS",
			"icon": "simple-icons:reactivex"
		},
		{
			"name": "HTML",
			"icon": "simple-icons:html5"
		},
		{
			"name": "CSS",
			"icon": "simple-icons:css"
		},
		{
			"name": "TypeScript",
			"icon": "simple-icons:typescript"
		},
		{
			"name": "JavaScript",
			"icon": "simple-icons:javascript"
		},
		{
			"name": "React",
			"icon": "simple-icons:react"
		},
		{
			"name": "Jest",
			"icon": "simple-icons:jest"
		},
		{
			"name": "Playwright",
			"icon": "custom:playwright"
		},
		{
			"name": "Cypress",
			"icon": "simple-icons:cypress"
		},
		{
			"name": "C#",
			"icon": "code"
		},
		{
			"name": ".NET Core",
			"icon": "simple-icons:dotnet"
		},
		{
			"name": "SQL",
			"icon": "database"
		}
	]
}
